<template>
  <footer class="bg-gray-200 w-full text-black sm:px-16 pt-10">
    <section class="lg:container px-4 md:px-10 mx-auto gap-16 relative text-xs py-20 flex flex-col">
      <div class="grid 2xl:grid-cols-footer grid-cols-footerTablet gap-8">
        <div>
          <h1 class="font-semibold">
            Общество с ограниченной ответственностью Микрокредитная компания «ДнД» (ООО МКК «ДнД»).
          </h1>
          <p>
            Регистрационный номер записи в в государственном реестре микрофинансовых организаций:
            №1703140008565
          </p>
          Дата внесения в государственный реестр микрофинансовых организаций 25.10.2017
          <p>ИНН 7840068180, ОГРН 1177847234245</p>
          <p>
            Информация о структуре и составе участников микрофинансовой организации ООО МКК «ДнД»
          </p>
          <p>
            Информация об условиях предоставления, использования и возврата потребительского займа
          </p>
          <p>
            Правила предоставления микрозаймов Устав ООО МКК «ДнД» является членом Саморегулируемой
            организации «МиР» с 15.11.2017 г.
          </p>
        </div>
        <div>
          <h1 class="font-semibold">
            Общество с ограниченной ответственностью Микрокредитная компания «Блисс» (ООО МКК
            «Блисс»).
          </h1>
          <p>
            Регистрационный номер записи в в государственном реестре микрофинансовых организаций:
            №1803550008778
          </p>
          <p>Дата внесения в государственный реестр микрофинансовых организаций 07.03.2018</p>
          <p>ИНН 5404070027, ОГРН 1185476002117</p>
          <p>
            Информация о структуре и составе участников микрофинансовой организации ООО МКК «Блисс»
          </p>
          <p>
            Информация об условиях предоставления, использования и возврата потребительского займа
          </p>
          <p>
            Правила предоставления микрозаймов Устав ООО МКК «Блисс» является членом
            Саморегулируемой организации «МиР» с 03.04.2018 г.
          </p>
        </div>
        <div>
          <h1 class="font-semibold">
            Общество с ограниченной ответственностью Микрокредитная компания «Рубикон» (ООО МКК
            «Рубикон»).
          </h1>
          <p>
            Регистрационный номер записи в в государственном реестре микрофинансовых организаций:
            №1903504009121
          </p>
          <p>Дата внесения в государственный реестр микрофинансовых организаций 14.02.2019</p>
          <p>ИНН 2465130359, ОГРН 1152468038568</p>
          <p>
            Информация о структуре и составе участников микрофинансовой организации ООО МКК
            «Рубикон»
          </p>
          <p>
            Информация об условиях предоставления, использования и возврата потребительского займа
          </p>
          <p>
            Правила предоставления микрозаймов Устав ООО МКК «Рубикон» является членом
            Саморегулируемой организации «МиР» с 26.03.2019 г.
          </p>
        </div>
        <div>
          <p>Место непосредственного ведения деятельности МФО</p>

          <p>Персональный состав органов управления МФО</p>
          <p>Режим работы МФО и ее обособленных подразделений</p>
          <p>Базовый стандарт по управлению рисками микрофинансовых организаций</p>
          <p>
            Базовый стандарт защиты прав и интересов физических и юридических лиц — получателей
            финансовых услуг, оказываемых членами саморегулируемых организаций в сфере финансового
            рынка, объединяющих микрофинансовые организации
          </p>
          <p>
            Базовый стандарт совершения микрофинансовой организацией операций на финансовом рынке
          </p>
        </div>
      </div>
      <hr class="h-x bg-white w-full opacity-40" />
      <div class="grid grid-cols-footerTablet gap-8">
        <div class="flex flex-col gap-2">
          <p class="font-bold text-sm">СРО «МиР»</p>
          <a href="https://npmir.ru/">https://npmir.ru/</a>
          <p>107078, г. Москва Орликов переулок, д.5, стр.1, этаж 2, пом.11</p>
        </div>
        <div class="flex flex-col gap-4">
          <div>
            <p class="font-bold text-sm">Банк России</p>
            <a href="https://www.cbr.ru/">https://www.cbr.ru/</a>
          </div>
          <div>
            <p class="font-bold text-sm">Интернет-приемная Банка России</p>
            <a href="https://www.cbr.ru/Reception/">https://www.cbr.ru/Reception/</a>
          </div>
          <div>
            <p class="font-bold text-sm">Реестры субъектов рынка микрофинансирования</p>
            <a href="https://www.cbr.ru/microfinance/registry/"
              >https://www.cbr.ru/microfinance/registry/</a
            >
          </div>
        </div>
        <div class="flex flex-col justify-between">
          <p>
            Потребитель финансовых услуг вправе направить обращение финансовому уполномоченному в
            соответствии со статьями 15-19 Федерального закона от 4 июня 2018 года N 123-ФЗ "Об
            уполномоченном по правам потребителей финансовых услуг".
          </p>
          <div>
            <a class="font-bold text-sm" href="https://finombudsman.ru/"
              >119017, г. Москва, Старомонетный пер., дом 3</a
            >
            <p class="font-bold text-sm">8 (800) 200-00-10</p>
          </div>
        </div>
      </div>
      <hr class="h-px bg-white w-full opacity-40" />
      <div class="grid grid-cols-footerElements gap-16 justify-items-center">
        <PaymentLogo v-for="el in payments" :key="el.id" :el="el" />
      </div>
      <div class="absolute top-5 left-5 md:left-10">
        <p>Телефон (звонок по РФ бесплатный)</p>
        <p class="text-2xl">8 (800) 77-00-221</p>
      </div>
    </section>
  </footer>
</template>

<script>
export default {
  data() {
    return {
      payments: [
        { id: 1, logo: 'mirLogo.svg' },
        { id: 2, logo: 'visa.jpg' },
        { id: 3, logo: 'mir_accept.png' },
        { id: 4, logo: 'mastercard.png' },
      ],
    };
  },
};
</script>

<style lang="scss" scoped></style>
